; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 663194 2 2 3 8 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	thermograph0 - mode
	image2 - mode
	thermograph1 - mode
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	GroundStation5 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 thermograph1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation7)
	(supports instrument2 thermograph1)
	(supports instrument2 image2)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon10)
)
(:goal (and
	(pointing satellite0 GroundStation5)
	(pointing satellite1 GroundStation0)
	(have_image Planet8 image2)
	(have_image Phenomenon9 image2)
	(have_image Phenomenon10 thermograph0)
	(have_image Planet11 thermograph0)
	(have_image Planet12 thermograph1)
	(have_image Phenomenon13 thermograph0)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 8
2. (turn_to satellite0 groundstation5 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 groundstation5)
   goals met: 1 of 8
3. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 8
4. (turn_to satellite1 planet8 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet8)
   goals met: 1 of 8
5. (calibrate satellite0 instrument1 groundstation5)
   added: (calibrated instrument1)
   goals met: 1 of 8
6. (turn_to satellite1 groundstation0 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 groundstation0)
   goals met: 2 of 8
7. (calibrate satellite1 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 2 of 8
8. (turn_to satellite0 planet12 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 planet12)
   goals met: 1 of 8
9. (take_image satellite0 planet12 instrument1 thermograph1)
   added: (have_image planet12 thermograph1)
   goals met: 2 of 8
10. (turn_to satellite1 planet8 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet8)
   goals met: 1 of 8
11. (turn_to satellite0 groundstation5 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 groundstation5)
   goals met: 2 of 8
12. (take_image satellite1 planet8 instrument2 image2)
   added: (have_image planet8 image2)
   goals met: 3 of 8
13. (turn_to satellite1 phenomenon9 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 phenomenon9)
   goals met: 3 of 8
14. (turn_to satellite0 planet11 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 planet11)
   goals met: 2 of 8
15. (take_image satellite1 phenomenon9 instrument2 image2)
   added: (have_image phenomenon9 image2)
   goals met: 3 of 8
16. (take_image satellite0 planet11 instrument1 thermograph0)
   added: (have_image planet11 thermograph0)
   goals met: 4 of 8
17. (turn_to satellite1 groundstation0 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 groundstation0)
   goals met: 5 of 8
18. (turn_to satellite0 phenomenon13 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon13)
   goals met: 5 of 8
19. (take_image satellite0 phenomenon13 instrument1 thermograph0)
   added: (have_image phenomenon13 thermograph0)
   goals met: 6 of 8
20. (turn_to satellite1 phenomenon10 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon10)
   goals met: 5 of 8
21. (turn_to satellite0 groundstation5 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 groundstation5)
   goals met: 6 of 8
22. (take_image satellite1 phenomenon10 instrument2 thermograph0)
   added: (have_image phenomenon10 thermograph0)
   goals met: 7 of 8
23. (turn_to satellite1 groundstation0 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 groundstation0)
   goals met: 8 of 8
